SMP_OnlineExchange/src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектов</name>
  <enumValues>
    <name>БизнесПроцесс</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>ВидРасчета</name>
  </enumValues>
  <enumValues>
    <name>ВидСубконто</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>Задача</name>
  </enumValues>
  <enumValues>
    <name>Календарь</name>
  </enumValues>
  <enumValues>
    <name>НаборКонстант</name>
  </enumValues>
  <enumValues>
    <name>Перечисление</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовРасчета</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовХарактеристик</name>
  </enumValues>
  <enumValues>
    <name>ПланОбмена</name>
  </enumValues>
  <enumValues>
    <name>ПланСчетов</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>РегистрНакопления</name>
  </enumValues>
  <enumValues>
    <name>РегистрРасчета</name>
  </enumValues>
  <enumValues>
    <name>РегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>ТочкаМаршрутаБизнесПроцесса</name>
  </enumValues>
  <enumValues>
    <name>УникальныйИдентификатор</name>
  </enumValues>
  <enumValues>
    <name>ХранилищеЗначения</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
</mdclass:Enum>

SMP_OnlineExchange/src/Catalogs/Объекты/Объекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Объекты</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Иерархический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИерархии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>23</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьКоличествоУровней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУровней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерииКодов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>29</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольУникальности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоНумерация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подчиненный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

SMP_OnlineExchange/src/Catalogs/ПравилаКонвертацииОбъектов/ПравилаКонвертацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииОбъектов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СМП_УчетныеЗаписиОбменов</owners>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Объекты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.Объекты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередВыгрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриВыгрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗагрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриЗагрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапоминатьВыгруженные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьПоИдентификатору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыгружатьОбъектыСвойствПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПоследовательностьПолейПоиска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБыстрыйПоискПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьНовыйНомерИлиКодЕслиНеУказан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОбъектовОбмена</name>
    <type>
      <types>EnumRef.ПриоритетОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъектаВФайлОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкаВариантовПоискаОбъектов</name>
    <attributes>
      <name>ИмяНастройкиДляАлгоритма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SMP_OnlineExchange/src/CommonModules/СМП_ОбщегоНазначения/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// АДАПТИРОВАННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗ КОНВЕРТАЦИИ ДАННЫХ 2:
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет имя на корректность.
//
// Параметры: 
//  Имя            - Строка, содержащая имя для проверки.
//
// Возвращаемое значение:
//  Истина - имя корректно, иначе Ложь.
//
Функция глИмяКорректно(Знач Имя) Экспорт

	ИмяПроверки = СокрП(Имя);
	
	СтруктураДляПроверки = Новый Структура;
	Попытка
		СтруктураДляПроверки.Вставить(ИмяПроверки);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Отделяет от исходной строки левую часть до разделителя и присваивает это значение исходной строке,
// а правую часть возвращает.
//
// Параметры: 
//  Стр            - Исходная строка.
//  Типы           - Подстрока разделитель.
//  Режим          - 1, разделитель в левой части строки
//                   2, разделитель в правой части строки
//
// Возвращаемое значение:
//  Строка, содержащая правую часть исходной строки после разделителя.
//
Функция глОтделитьРазделителем(Стр, Знач Разделитель = ".", Режим = 0, ЕслиНетРазделителяВернутьИсходнуюСтроку = Ложь) Экспорт
	
	ПраваяЧасть	= "";
	Разделитель	= Найти(Стр, Разделитель);
	Если Разделитель > 0 Тогда
		
		ПраваяЧасть	= Сред(Стр, Разделитель + ?(Режим = 2, 0, 1));
		Стр			= СокрЛП(Лев(Стр, Разделитель - ?(Режим = 1, 0, 1)));
		
	ИначеЕсли ЕслиНетРазделителяВернутьИсходнуюСтроку = Истина Тогда
		
		ПраваяЧасть = СокрЛП(Стр);
		Стр = "";
		
	КонецЕсли;
	
	Возврат(ПраваяЧасть);
	
КонецФункции // глОтделитьРазделителем()

// Формирует наименование для правила конвертации объектов.
//
// Параметры: 
//   Правило - СправочникСсылка.ПравилаКонвертацииОбъектов - Правило, для которого формируется наименование.
//
// Возвращаемое значение:
//  Строка - содержит наименование правила.
//
Функция глНаименованиеПКО(Знач Правило) Экспорт

	Возврат Строка(Правило.Источник.Тип) + ": " + Правило.Источник.Синоним;
	
КонецФункции // глНаименованиеПКО()

// Получает имя объекта без типа.
//
// Параметры: 
//  Объект         - Объект, для которого необходимо получить имя.
//
// Возвращаемое значение:
//  Строка, содержащая имя объекта.
//
Функция глИмяОбъекта(Объект) Экспорт
	
	Возврат СокрЛП(глОтделитьРазделителем(СокрЛП(Объект), , , Истина));
	
КонецФункции // глИмяОбъекта()

// Проверяет, имеет ли указанный объект метаданных ссылку
//
// Параметры:
//  Объект         - элемент справочника Объекты
// 
Функция глЕстьСсылка(Объект, ЭтоПеречисление = Неопределено) Экспорт
	
	ТипОбъекта   = Объект.Тип;
	ТипыОбъектов = Перечисления.ТипыОбъектов;
	
	Если (ТипОбъекта = ТипыОбъектов.Справочник)
		Или (ТипОбъекта = ТипыОбъектов.Документ)
		Или (ТипОбъекта = ТипыОбъектов.Перечисление)
		Или (ТипОбъекта = ТипыОбъектов.ПланСчетов)
		Или (ТипОбъекта = ТипыОбъектов.ПланВидовХарактеристик)
		Или (ТипОбъекта = ТипыОбъектов.ПланВидовРасчета)
		Или (ТипОбъекта = ТипыОбъектов.ПланОбмена)
		Или (ТипОбъекта = ТипыОбъектов.Задача)
		Или (ТипОбъекта = ТипыОбъектов.БизнесПроцесс)
		Или (ТипОбъекта = ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса)
		Тогда
		ЭтоПеречисление = (ТипОбъекта = ТипыОбъектов.Перечисление);
		Возврат Истина;
	Иначе
		ЭтоПеречисление = Ложь;
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции

// Формирует наименование для конвертации.
//
// Параметры: 
//  Правило        - Правило, для которого формируется наименование.
//
// Возвращаемое значение:
//  Строка, содержащая наименование правила.
//
Функция глНаименованиеКонвертации(Правило) Экспорт

	Возврат СокрЛП(СокрЛП(Правило.Источник) + " --> " + СокрЛП(Правило.Приемник));
	
КонецФункции // глНаименованиеКонвертации()

// Формирует наименование для правила конвертации свойств.
//
// Параметры: 
//  Правило        - Правило, для которого формируется наименование.
//
// Возвращаемое значение:
//  Строка, содержащая наименование правила.
//
Функция глНаименованиеПКС(Правило) Экспорт
	
	ИмяИсточника = СокрЛП(Правило.Источник);
	ИмяПриемника = СокрЛП(?(ПустаяСтрока(Правило.ИмяПараметраДляПередачи), Правило.Приемник, Правило.ИмяПараметраДляПередачи));
	
	ИмяПравила = "[ИмяИсточника] --> [ИмяПриемника]";
	ИмяПравила = СтрЗаменить(ИмяПравила, "[ИмяИсточника]", ИмяИсточника);
	ИмяПравила = СтрЗаменить(ИмяПравила, "[ИмяПриемника]", ИмяПриемника);
	
	Возврат СокрЛП(ИмяПравила);
	
КонецФункции // глНаименованиеПКС() 

// Формирует наименование для правила конвертации значений.
//
// Параметры: 
//  Правило        - Правило, для которого формируется наименование.
//
// Возвращаемое значение:
//  Строка, содержащая наименование правила.
//
Функция глНаименованиеПКЗ(Знач Правило) Экспорт

	Возврат СокрЛП(СокрЛП(Правило.Источник) + " --> " + СокрЛП(Правило.Приемник));
	
КонецФункции // глНаименованиеПКЗ() 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсточникПриИзмененииПКО(Объект) Экспорт
	
	// надо попробовать найти приемник
	Если НЕ ЗначениеЗаполнено(Объект.Источник) 
		ИЛИ ЗначениеЗаполнено(Объект.Приемник) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Приемник = НайтиОбъектПоИмениИВладельцу(Объект.Источник.Наименование, Объект.Владелец.Приемник);
	
	Если Объект.ЭтоНовый() Тогда
		Объект.СгенерироватьУникальныйКод();
		Объект.СинхронизироватьПоИдентификатору = ОпределитьНужнаСинхронизацияПоИдентификатору(Объект);
		Объект.НеЗапоминатьВыгруженные = ОпределитьНужноНеЗапоминатьВыгруженныеОбъекты(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриемникПриИзмененииПКО(Объект) Экспорт
	
	Если Объект.ЭтоНовый() Тогда
		Объект.СгенерироватьУникальныйКод();
		Объект.СинхронизироватьПоИдентификатору = ОпределитьНужнаСинхронизацияПоИдентификатору(Объект);
		Объект.НеЗапоминатьВыгруженные = ОпределитьНужноНеЗапоминатьВыгруженныеОбъекты(Объект);
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиОбъектПоИмениИВладельцу(ИмяОбъекта, Владелец) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ Первые 1
	               |	Объекты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Объекты КАК Объекты
	               |ГДЕ
	               |	Объекты.Наименование = &Имя
	               |	И Объекты.Владелец = &Владелец";
				   
	Запрос.УстановитьПараметр("Имя", ИмяОбъекта);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.Объекты.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьМассивИменОбработчиков(НазваниеОбъекта, ПолучитьОбработчикиТолькоДляВыгрузки = Неопределено) Экспорт
	
	МассивОбработчиков = Новый Массив();
	
	НужноВыгружатьОбработчикиВыгрузки = ПолучитьОбработчикиТолькоДляВыгрузки = Неопределено
		ИЛИ ПолучитьОбработчикиТолькоДляВыгрузки = Истина;
		
	НужноВыгружатьОбработчикиЗагрузки = ПолучитьОбработчикиТолькоДляВыгрузки = Неопределено
		ИЛИ ПолучитьОбработчикиТолькоДляВыгрузки = Ложь;
	
	Если НазваниеОбъекта = "Конвертация" Тогда
		
		Если НужноВыгружатьОбработчикиВыгрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиПравилОбмена");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойДанных");
			МассивОбработчиков.Добавить("АлгоритмПередПолучениемИзмененныхОбъектов");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиДанных");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПередКонвертациейОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПередОтправкойИнформацииОбУдалении");
		КонецЕсли;

		Если НужноВыгружатьОбработчикиЗагрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПередЗагрузкойДанных");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиДанных");
			МассивОбработчиков.Добавить("АлгоритмПередЗагрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПриПолученииИнформацииОбУдалении");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиПараметров");
			МассивОбработчиков.Добавить("АлгоритмПослеПолученияИнформацииОбУзлахОбмена");
		КонецЕсли;
		
	ИначеЕсли НазваниеОбъекта = "ГруппаСвойств" Тогда
		
		Если НужноВыгружатьОбработчикиВыгрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПередОбработкойВыгрузки");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойСвойства");
			МассивОбработчиков.Добавить("АлгоритмПриВыгрузкеСвойства");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиСвойства");
	        МассивОбработчиков.Добавить("АлгоритмПослеОбработкиВыгрузки");
		КонецЕсли;
		
	ИначеЕсли НазваниеОбъекта = "Свойства" Тогда
		
		Если НужноВыгружатьОбработчикиВыгрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойСвойства");
			МассивОбработчиков.Добавить("АлгоритмПриВыгрузкеСвойства");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиСвойства");
		КонецЕсли;
		
	ИначеЕсли НазваниеОбъекта = "ПравилаВыгрузкиДанных" Тогда
		
		Если НужноВыгружатьОбработчикиВыгрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПередОбработкойПравила");
			МассивОбработчиков.Добавить("АлгоритмПослеОбработкиПравила");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъекта");
		КонецЕсли
		
	ИначеЕсли НазваниеОбъекта = "ПравилаКонвертацииОбъектов" Тогда
		
		Если НужноВыгружатьОбработчикиВыгрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПриВыгрузкеОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъектаВФайлОбмена");
		КонецЕсли;
		
		Если НужноВыгружатьОбработчикиЗагрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПередЗагрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПриЗагрузкеОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПоследовательностьПолейПоиска");
		КонецЕсли;
						
	ИначеЕсли НазваниеОбъекта = "ПравилаРегистрацииОбъектов" Тогда
		
		МассивОбработчиков.Добавить("АлгоритмПередОбработкойПравила");
		МассивОбработчиков.Добавить("АлгоритмПриОбработкеПравила");
		МассивОбработчиков.Добавить("АлгоритмПриОбработкеДополнительныйПравила");
		МассивОбработчиков.Добавить("АлгоритмПослеОбработкиПравила");
		
	ИначеЕсли НазваниеОбъекта = "ПравилаОчисткиОбъектов" Тогда
		
		Если НужноВыгружатьОбработчикиЗагрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПередОбработкойПравила");
			МассивОбработчиков.Добавить("АлгоритмПередУдалениемОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеОбработкиПравила");
		КонецЕсли;
		
	ИначеЕсли НазваниеОбъекта = "Параметры" Тогда
		
		Если НужноВыгружатьОбработчикиЗагрузки Тогда
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиПараметра");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивОбработчиков;
	
КонецФункции

Функция СформироватьУникальныйКодДляСправочника(ИмяСправочника, ТекущееЗначениеКода, СсылкаНаЭлемент, Владелец) Экспорт
	
	ТекущееЗначениеКода = Сред(ТекущееЗначениеКода, 1, 45);
	
	Если ПустаяСтрока(ТекущееЗначениеКода) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Максимум(Спр.Код) КАК КОД
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Спр
	|ГДЕ
	|	Спр.Владелец = &Владелец
	|
	|	И Спр.Ссылка <> &Ссылка
	|
	|	И (Спр.КОД = """ + ТекущееЗначениеКода + """
	|	)";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);			   
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТекущееЗначениеКода;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Не ЗначениеЗаполнено(Выборка.КОД) Тогда
			Возврат ТекущееЗначениеКода;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Максимум(Спр.Код) КАК КОД
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Спр
	|ГДЕ
	|	Спр.Владелец = &Владелец
	|
	|	И Спр.Ссылка <> &Ссылка
	|
	|	И (Спр.КОД Подобно """ + СокрЛП(ТекущееЗначениеКода) + "[0-9]%"" )";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТекущееЗначениеКода;
	КонецЕсли;
			
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	МаксимальныйКод = СокрЛП(Выборка.Код);
	
	МаксимальныйКод = СтрЗаменить(Строка(МаксимальныйКод), Символы.НПП, "");
	
	Если ПустаяСтрока(МаксимальныйКод) Тогда
		Возврат СокрЛП(ТекущееЗначениеКода) + "00001";
	КонецЕсли;
	
	//с конца строки ищем цифры
	ИтоговоеЧисло = "";
	ДлинаСтрокиМаксимальногоКода = СтрДлина(МаксимальныйКод);
	ТекущаяПозиция = ДлинаСтрокиМаксимальногоКода;
	ЭтоЦифры = Истина;
	
	Пока ЭтоЦифры 
		И ТекущаяПозиция > 0 Цикл
		
		ТекущийСимвол = Сред(МаксимальныйКод, ТекущаяПозиция, 1);
		ЭтоЦифры = (ТекущийСимвол >= "0") И (ТекущийСимвол <= "9");
		
		Если ЭтоЦифры Тогда
			ИтоговоеЧисло = ИтоговоеЧисло + ТекущийСимвол;
		Иначе
			Прервать;
		КонецЕсли;
		
		ТекущаяПозиция = ТекущаяПозиция - 1;
		
	КонецЦикла;
	
	ПозицияНачалаЦифр = ТекущаяПозиция + 1;
	
	Если ПустаяСтрока(ИтоговоеЧисло) Тогда
		
		Возврат МаксимальныйКод + "00001";
		
	Иначе
		
		ОбщийПрефикс = Сред(МаксимальныйКод, 1, ПозицияНачалаЦифр - 1);
		ДобавочноеЧисло = Число(Сред(МаксимальныйКод, ПозицияНачалаЦифр)) + 1;
		
	КонецЕсли;
	
	Возврат ОбщийПрефикс + Прав("0000" + СтрЗаменить(Строка(ДобавочноеЧисло), Символы.НПП, ""), 5);
	
КонецФункции

Процедура УстановитьГруппуПоУмолчаниюДляПКО(Объект) Экспорт
	
	// ищем возможного родителя по приемнику...
	ИмяГруппы = ОпределитьИмяГруппыДляПКО(Объект.ТипПриемника);
	
	Если Не ПустаяСтрока(ИмяГруппы) Тогда
		
		ПредполагаемыйРодитель = Справочники.ПравилаКонвертацииОбъектов.НайтиПоКоду(ИмяГруппы, , , Объект.Владелец);
		
		Если ПредполагаемыйРодитель.Пустая() Тогда
			
			ГруппаРодителя = Справочники.ПравилаКонвертацииОбъектов.СоздатьГруппу();
			ГруппаРодителя.Владелец = Объект.Владелец;
			ГруппаРодителя.Код = ИмяГруппы;
			ГруппаРодителя.Наименование = ИмяГруппы;
			ГруппаРодителя.Записать();
			
			ПредполагаемыйРодитель = ГруппаРодителя.Ссылка;
			
		КонецЕсли;
		
		Объект.Родитель = ПредполагаемыйРодитель;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьИмяГруппыДляПКО(ИмяТипаПриемника) Экспорт
	
	Если Найти(ИмяТипаПриемника, "ДокументСсылка.") > 0 Тогда
		
		Возврат "Документы";
		
	ИначеЕсли Найти(ИмяТипаПриемника, "СправочникСсылка.") > 0 Тогда
		
		Возврат "Справочники";
		
	ИначеЕсли Найти(ИмяТипаПриемника, "ПеречислениеСсылка.") > 0 Тогда
		
		Возврат "Перечисления";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "ПланОбменаСсылка.") > 0 Тогда
		
		Возврат "Планы обмена";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "ПланВидовХарактеристикСсылка.") > 0 Тогда
		
		Возврат "Планы видов характеристик";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "ПланСчетовСсылка.") > 0 Тогда
		
		Возврат "Планы счетов";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "ПланВидовРасчетаСсылка.") > 0 Тогда
		
		Возврат "Планы видов расчета";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "РегистрСведенийЗапись.") > 0 Тогда
		
		Возврат "Регистры сведений";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "РегистрНакопленияЗапись.") > 0 Тогда
		
		Возврат "Регистры накопления";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "РегистрБухгалтерииЗапись.") > 0 Тогда
		
		Возврат "Регистры бухгалтерии";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "РегистрРасчетаЗапись.") > 0 Тогда
		
		Возврат "Регистры расчета";	
		
	ИначеЕсли Найти(ИмяТипаПриемника, "БизнесПроцессСсылка.") > 0
		ИЛИ Найти(ИмяТипаПриемника, "ТочкаМаршрутаБизнесПроцессаСсылка.") > 0 Тогда
		
		Возврат "Бизнес-процессы";
		
	ИначеЕсли Найти(ИмяТипаПриемника, "ЗадачаСсылка.") > 0 Тогда
		
		Возврат "Задачи";	
		
	КонецЕсли;
	
	Возврат "";
		
КонецФункции

// Определяет очередной порядок для правила.
//
// Параметры: 
//  ИдентСправочника - Имя справочника правил.
//  ТекРодитель      - Родитель, в пределах которого необходимо определить порядок.
//  ТекВладелец      - Владелец, в пределах которого необходимо определить порядок.
//
// Возвращаемое значение:
//  Новый порядок.
//
Функция ОчереднойПорядок(ИдентСправочника, ТекРодитель, ТекВладелец) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Максимум(СПР.Порядок) КАК Порядок
	               |ИЗ
	               |	Справочник." + ИдентСправочника + " КАК СПР
	               |ГДЕ
	               |	СПР.Владелец = &Владелец
	               |	И СПР.Родитель = &Родитель";
				   
	Запрос.УстановитьПараметр("Владелец", ТекВладелец);
	Запрос.УстановитьПараметр("Родитель", ТекРодитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		И Выборка.Порядок <> NULL Тогда
		
		НовыйПорядок = Выборка.Порядок + 50;
		
	Иначе
		
		НовыйПорядок = 50;
		
	КонецЕсли;
		
	Возврат НовыйПорядок;
	
КонецФункции // ОчереднойПорядок()

Функция ОпределитьНужноНеЗапоминатьВыгруженныеОбъекты(Объект) Экспорт
	
	// определим сохранять загруженные объекты или нет
	// сохранять если источник и приемник ссылочного типа, если и тот и другой не ссылочного - не сохранять
	ИсточникСсылка = (ЗначениеЗаполнено(Объект.Источник)) И глЕстьСсылка(Объект.Источник);
	ПриемникСсылка = (ЗначениеЗаполнено(Объект.Приемник)) И глЕстьСсылка(Объект.Приемник);
	
	Если НЕ ИсточникСсылка
		И Не ПриемникСсылка Тогда
		
		// нет смысла запоминать выгруженные объекты
		Возврат Истина;	
		
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

Функция ОпределитьНужнаСинхронизацияПоИдентификатору(Объект) Экспорт
	
	//Если ЭтоПриложение8(Объект.Владелец.Приемник.Приложение) И
	//	 ЭтоПриложение8(Объект.Владелец.Источник.Приложение) Тогда
			 
		ЭтоПеречисление = Ложь;
		ЕстьСсылка = глЕстьСсылка(Объект.Приемник, ЭтоПеречисление);
					
		Если ЕстьСсылка 
			И НЕ ЭтоПеречисление Тогда
			
			Возврат Истина;
			
		КонецЕсли;
					
	//КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
